# Parameters
nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]  
  
backbone:
  # Initial layers
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  
  # First feature level with SS2D
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, SS2D_Block, [256]]  # 5 - 
  
  # Second feature level with SS2D
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 6, C2f, [512, True]]   # 7
  - [-1, 1, SS2D_Block, [512]]  # 8 - 
  
  # High-level features
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 3, C2f, [1024, True]]   # 10
  - [-1, 1, SPPF, [1024, 5]]     # 11

head:
  # Semantic Collection 
  - [0, 1, nn.AvgPool2d, [8, 8, 0]]     # 12 - 
  - [2, 1, nn.AvgPool2d, [4, 4, 0]]     # 13 - 
  - [5, 1, nn.AvgPool2d, [2, 2, 0]]     # 14 - 
  - [11, 1, nn.Upsample, [None, 2, 'nearest']]  # 15 
  - [[12, 13, 14, 8, 15], 1, Concat, [1]]  # 16 

  # HyperC2Net Processing
  - [-1, 1, Conv, [512, 1, 1]]          # 17
  - [-1, 1, HyperComputeModule, [512]]  # 18
  - [-1, 2, MANet, [512, True]]         # 19

  # RepBFPAN Feature Fusion
  - [-1, 1, SimConv, [256, 1, 1]]       # 20
  - [[8, 5, -1], 1, BiFusion, [256]]    # 21
  - [-1, 1, Conv, [256, 1, 1]]          # 22
  - [-1, 8, RepBlock, [256]]            # 23

  - [-1, 1, SimConv, [128, 1, 1]]       # 24
  - [[5, 2, -1], 1, BiFusion, [128]]    # 25
  - [-1, 1, Conv, [128, 1, 1]]          # 26
  - [-1, 8, RepBlock, [128]]            # 27

  - [-1, 1, SimConv, [128, 3, 2]]       # 28
  - [[-1, 23], 1, Concat, [1]]          # 29
  - [-1, 8, RepBlock, [256]]            # 30

  - [-1, 1, SimConv, [256, 3, 2]]       # 31
  - [[-1, 19], 1, Concat, [1]]          # 32 
  - [-1, 8, RepBlock, [512]]            # 33

  - [[27, 30, 33], 1, Detect, [nc]]     # 34
